In [1]:
import xlrd

In [2]:
import xlwt

In [3]:
wb = xlrd.open_workbook('supermarkets.xlsx')

In [4]:
print(wb)

<xlrd.book.Book object at 0x000002229658F370>

In [6]:
wb.sheet_names()

['Ark1', 'Ark2', 'Ark3']

In [8]:
ws = wb.sheet_by_name('Ark1')

In [9]:
ws0 = wb.sheet_by_index(0)

In [10]:
r0 = ws0.row(0)

In [11]:
r0

[text:'ID',
 text:'Address',
 text:'City',
 text:'State',
 text:'Country',
 text:'Supermarket Name',
 text:'Number of Employees']

In [14]:
for i in r0:
    print(i)
    break

text:'ID'

In [15]:
r0[0]

text:'ID'

In [16]:
c0 = r0[0]

In [17]:
c0.value

'ID'

In [20]:
ws0.nrows

7

In [21]:
for r in range(ws0.nrows):
    row = ws0.row(r)
    for c in row:
        print(c.value, end=' ')
    print('')

ID Address City State Country Supermarket Name Number of Employees
1.0 3666 21st St San Francisco CA 94114 USA Madeira 8.0
2.0 735 Dolores St San Francisco CA 94119 USA Bready Shop 15.0
3.0 332 Hill St San Francisco California 94114 USA Super River 25.0
4.0 3995 23rd St San Francisco CA 94114 USA Ben's Shop 10.0
5.0 1056 Sanchez St San Francisco California USA Sanchez 12.0
6.0 551 Alvarado St San Francisco CA 94114 USA Richvalley 20.0

In [24]:
ws0.cell(0,0).value

'ID'

In [25]:
file = xlwt.Workbook()

In [26]:
sheet0 = file.add_sheet('My Registration Data')

In [27]:
sheet0.write(0,0,400)
sheet0.write(0,1,500)
sheet0.write(0,2,500)
sheet0.write(0,3,500)
file.save('myfile.xlsx')

In [29]:
file.save('my1.xls')

# DBMS

1. Create
2. Retrieve
3. Update
4. Delete

(CRUD - Operations)

Engines
1. SQLite
2. MySQL
3. Oracle
4. Postgre
5. Mongo
6. Maria
...

ind    | Name    | Price
-----------------------------
1      | ABC     | 100
2      | XYZ     | 300

# Some SQL Queries

// To Create a table
CREATE TABLE table_name (ind int, name text, price float)

// To insert a data in some table (CREATE)
INSERT INTO table_name (ind, name, price) values (1, "ABC", 100)

// To read the data (RETRIEVE)
SELECT * FROM table_name
SELECT name FROM table_name

// To update the data (Updation)
UPDATE table_name SET name="ABCD" WHERE ind=1

// Deletion of Data
DELETE FROM table_name WHERE ind = 1

In [32]:
import sqlite3

db = sqlite3.connect('databasename')
#####################



db.execute('query')
db.execute('query')
db.execute('query')
db.commit()


db.execute('query')
r = db.execute('query')
data = r.fetchall()
db.commit()




db.close()

In [89]:
db = sqlite3.connect('mydb.sqlite')

In [38]:
db.execute('CREATE TABLE table_name (ind int, name text, price float)')

In [87]:
db.execute('CREATE TABLE IF NOT EXISTS mydata (ind int, name text, price float)')

In [43]:
db.execute('CREATE TABLE mydata (ind int, name text, price float)')
db.execute('INSERT INTO mydata (ind, name, price) values (1, "ABC", 100)')
db.execute('INSERT INTO mydata (ind, name, price) values (2, "XYZ", 300)')

In [45]:
db.execute('INSERT INTO mydata (ind, name, price) values (3, "threedata", 400),(4, "four", 400),(5, "somthing", 600)')

In [90]:
r = db.execute('SELECT * FROM mydata')

In [91]:
data = r.fetchall()
data

[(2, 'XYZ', 0.0),
 (3, 'threedata', 0.0),
 (4, 'four', 0.0),
 (5, 'somthing', 0.0)]

In [55]:
r.fetchone()

(3, 'threedata', 400.0)

In [59]:
r1 = db.execute('SELECT name FROM mydata')
data = r1.fetchall()
data

[('ABC',), ('XYZ',), ('threedata',), ('four',), ('somthing',)]

In [60]:
r1 = db.execute('SELECT name,price FROM mydata')
data = r1.fetchall()
data

[('ABC', 100.0),
 ('XYZ', 300.0),
 ('threedata', 400.0),
 ('four', 400.0),
 ('somthing', 600.0)]

In [61]:
r1 = db.execute('SELECT * FROM mydata WHERE ind=3')
data = r1.fetchall()
data

[(3, 'threedata', 400.0)]

In [64]:
db.execute('UPDATE mydata SET name="ABCD" WHERE ind=1')

In [66]:
db.execute('UPDATE mydata SET price = 0')

In [69]:
db.execute('DELETE FROM mydata WHERE ind = 1')

In [83]:
# db.execute('DROP TABLE table_name')

In [79]:
db.commit()

In [92]:
db.close()

In [88]:
col = ['ind','name','price']

In [93]:
data

[(2, 'XYZ', 0.0),
 (3, 'threedata', 0.0),
 (4, 'four', 0.0),
 (5, 'somthing', 0.0)]

In [94]:
# d = {'ind':[2,3,4,5], 'name':['XYZ','thre......']}

In [98]:
d = {i:[] for i in col}
d

{'ind': [], 'name': [], 'price': []}

In [100]:
for i in range(len(col)):
    for v in data:    
        d[col[i]] += [v[i]]

In [101]:
d

{'ind': [2, 3, 4, 5],
 'name': ['XYZ', 'threedata', 'four', 'somthing'],
 'price': [0.0, 0.0, 0.0, 0.0]}

In [102]:
# enumerate, map, zip, **kwargs

In [106]:
# TASK 1 - to convert this data into dictionary with some of the above mentioned functions

In [107]:
# TASK 2 - Fetch the data from a text/csv/json and transfer it to SQL Database